# --------------------------------------- Workshop #2 -------------------------------------


* This workshop includes marked tasks that comprise 16% of your final mark in this module. 

* To complete the tasks, you need to apply data preprocessing methods discussed in Lecture 2. However, you may need to research to find solutions to some tasks. 

* You can duplicate the code and report cells if you need more than one code/report cell for your solution

# Tasks

## TASK 2.1: Download the adult dataset from Canvas, import it into Jupyter Notebook, and complete the following steps (Completing the report cell is required):

### a. Write a code to show how many Null values each column contains. Report the columns that contain Null values in the report cell (Hint: use the isna().sum() method to show the number of the Null values) (NOTE: Nan values are also considered as Null values) (1%). 

### b. Change the display setting and print the first 100 rows. Find columns that contain wrong data and report them in the report cell (1%). 


### c. We cannot inspect the entire data by eyes for columns containing wrong data. Explain in the report cell what method we could use to find all columns which contain wrong data (2%)

In [2]:
############# WRITE YOUR CODE IN THIS CELL (IF APPLICABLE)####################
#a

import numpy as np
import pandas as pd

adults = pd.read_csv('C:/Users/Uche Buzz/Desktop/School stuff/Data Mining and Infomatics/Dataset/adult.csv')

# Task 2.1a
## Print the sum of all the null values in each column

In [3]:
adults.isna().sum()

age                 0
workclass         963
fnlwgt              0
education           0
education-num       0
marital-status      0
occupation        966
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country    274
income              0
dtype: int64

In [4]:
adults.isna().sum().count

<bound method Series.count of age                 0
workclass         963
fnlwgt              0
education           0
education-num       0
marital-status      0
occupation        966
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country    274
income              0
dtype: int64>

# 2.1b
## Change the display to show 100 rows and highlight columns with false values

In [5]:
#b. Change the display
adults.head(200)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,23,Private,197387,5th-6th,3,Married-civ-spouse,Transport-moving,Other-relative,White,Male,0,0,40,Mexico,<=50K
196,36,Private,99374,Some-college,10,Divorced,Craft-repair,Not-in-family,White,Male,0,0,40,United-States,<=50K
197,40,Federal-gov,56795,Masters,14,Never-married,Exec-managerial,Not-in-family,White,Female,14084,0,55,United-States,>50K
198,35,Private,138992,Masters,14,Married-civ-spouse,Prof-specialty,Other-relative,White,Male,7298,0,40,United-States,>50K
199,24,Self-emp-not-inc,32921,HS-grad,9,Never-married,Sales,Not-in-family,White,Male,0,0,40,United-States,<=50K

## Wrong data columns

# 2.1c
## How do we change columns we have not seen

############# WRITE YOUR REPORT IN THIS CELL (IF APPLICABLE)####################

Well, because we cannot view the entire dataset, 
    - we can easily pick an error and then replace null values with mean values of that column (This is for numerical values)
    - Replace with a correct values
    - Drop the entire column if it will hinder our analysis

## TASK 2.2: Complete the following tasks (Completing the report cell is required):

### a. Determine whether the columns which contain Null values are numerical, nominal, or ordinal variables and report it in the report cell (1%).

### b. Delete all rows which contain Null values (1%). Then print the number of Null values of all columns using the isna().sum() method. 

### c. Import the dataset again. Find the mode of the categorical (i.e. nominal or ordinal) columns which contain Null values and use it to fill their Null values (2%)

# 2.2a
## Determine data type of the null variables

In [25]:

############### WRITE YOUR CODE IN THIS CELL (IF APPLICABLE)####################


adults.isna().sum().dtype
#().dtype is a function used to determine

dtype('int64')

# 2.2b
## Delete rows containing null values

In [7]:
#View the ones with null values

adults.isna().sum()

age                 0
workclass         963
fnlwgt              0
education           0
education-num       0
marital-status      0
occupation        966
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country    274
income              0
dtype: int64

In [8]:
#drop the columns with null values
adults.drop(['workclass', 'native-country', 'occupation'], axis=1, inplace=True)

In [9]:
adults.isna().sum()

age               0
fnlwgt            0
education         0
education-num     0
marital-status    0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
income            0
dtype: int64

# 2.2 c
## Find the mode of the categorical columns

In [10]:
#Import dataset again
data2 = pd.read_csv('C:/Users/Uche Buzz/Desktop/School stuff/Data Mining and Infomatics/Dataset/adult.csv')

In [11]:
#check null values
data2.isnull().sum()

age                 0
workclass         963
fnlwgt              0
education           0
education-num       0
marital-status      0
occupation        966
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country    274
income              0
dtype: int64

In [12]:
#find the mode of these
mode_workclass = data2['workclass'].mode()[0]
mode_occupation = data2['occupation'].mode()[0]
mode_native_country = data2['native-country'].mode()[0]

In [13]:
# Replace null values with the mode
data2['workclass'].fillna(mode_workclass, inplace=True)
data2['occupation'].fillna(mode_occupation, inplace=True)
data2['native-country'].fillna(mode_native_country, inplace=True)

C:\Users\Uche Buzz\AppData\Local\Temp\ipykernel_18492\2860103040.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data2['workclass'].fillna(mode_workclass, inplace=True)
C:\Users\Uche Buzz\AppData\Local\Temp\ipykernel_18492\2860103040.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data2['occupation'].fillna(mode_occupation, inplace=True)
C:\Users\Uche Buzz\AppData\Local\Temp\ipykernel_18492\2860103040.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data2['native-country'].fillna(mode_native_country, inplace=True)

In [14]:
# Verify if all missing values are filled
print(data2.isnull().sum())

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
income            0
dtype: int64

############# WRITE YOUR REPORT IN THIS CELL (IF APPLICABLE)####################

## TASK 2.3. Select one of the columns which contains wrong data. Write a code to fill the wrong cells with an appropriate value. You have the freedom to determine what value you want to use to fill the wrong cells (2%).

# 2.3
## Fill the wrong cells with the right data

In [15]:
############# WRITE YOUR CODE IN THIS CELL (IF APPLICABLE)####################

#import the dataset again
data4 = pd.read_csv('C:/Users/Uche Buzz/Desktop/School stuff/Data Mining and Infomatics/Dataset/adult.csv')

In [16]:
#View the entire dataset to quick glance for wrong data
data4.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

## For this task, I choose to replace in **[marital-status] column -** *"Married-civ-spouce"* to *"Married-to-civilian"*

In [17]:
#replace
data_replaced = data4['marital-status'].replace('Married-civ-spouse', 'Married-to-civilian', inplace=True)

C:\Users\Uche Buzz\AppData\Local\Temp\ipykernel_18492\2516893332.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data_replaced = data4['marital-status'].replace('Married-civ-spouse', 'Married-to-civilian', inplace=True)

In [18]:
#print only marital status column to see the change
print(data4['marital-status'].value_counts())

marital-status
Married-to-civilian      22379
Never-married            16117
Divorced                  6633
Separated                 1530
Widowed                   1518
Married-spouse-absent      628
Married-AF-spouse           37
Name: count, dtype: int64

############# WRITE YOUR REPORT IN THIS CELL (IF APPLICABLE)####################

## TASK 2.4: Complete the following tasks: 

### a. Assume we want to predict the income column as the output. Use the correct method to encode this column (1%). 

### b. Select one ordinal column and encode it using the appropriate method (1%) . 

### c. Select one nominal column and encode it using the appropriate method (1%).

### d. After encoding the nominal column in the previous step, find a method to append the encoded data to the dataset (2%). 

### e. Normalise the numerical columns of the dataset (1%)

# 2.4a
## Encode the income column

In [20]:
adults2 = pd.read_csv('C:/Users/Uche Buzz/Desktop/School stuff/Data Mining and Infomatics/Dataset/adult.csv')

In [21]:
############# WRITE YOUR CODE IN THIS CELL (IF APPLICABLE)####################
#Inport the necessary paaackage

from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

In [22]:
#install the package scikit- learn
pip install scikit-learn -- quiet

Requirement already satisfied: scikit-learn in c:\python312\lib\site-packages (1.4.1.post1)Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement quiet (from versions: none)
ERROR: No matching distribution found for quiet

[notice] A new release of pip is available: 23.2.1 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [30]:
# This is to check the column number for income
adults2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             48842 non-null  int64
 1   workclass       47879 non-null  object
 2   fnlwgt          48842 non-null  int64
 3   education       48842 non-null  object
 4   education-num   48842 non-null  int64
 5   marital-status  48842 non-null  object
 6   occupation      47876 non-null  object
 7   relationship    48842 non-null  object
 8   race            48842 non-null  object
 9   sex             48842 non-null  object
 10  capital-gain    48842 non-null  int64
 11  capital-loss    48842 non-null  int64
 12  hours-per-week  48842 non-null  int64
 13  native-country  48568 non-null  object
 14  income          48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [31]:
#X = adults2.drop('income',axis=1)
y = adults2.iloc[:,14] # Select the income column

In [32]:
y

0         <=50K
1         <=50K
2         <=50K
3         <=50K
4         <=50K
          ...
48837    <=50K.
48838    <=50K.
48839    <=50K.
48840    <=50K.
48841     >50K.
Name: income, Length: 48842, dtype: object

In [ ]:
# fit transform the Income column
y = le.fit_transform(y)

In [ ]:
#Print the result
y

array([0, 0, 0, ..., 1, 1, 3])

# 2.4 b
## Select one ordinal column and encode it

### For this task, I choose *sex* as an ordinal column to encode

In [34]:
#Assign the column
W = adults2.iloc[:,9]

In [35]:
#View the column to be sure
W

0          Male
1          Male
2          Male
3          Male
4        Female
          ...
48837    Female
48838      Male
48839      Male
48840      Male
48841      Male
Name: sex, Length: 48842, dtype: object

In [36]:
#Call the function and fit 
W = le.fit_transform(W)

In [37]:
#Print the new result
W

array([1, 1, 1, ..., 1, 1, 1])

# 2.4 c
## Choose a norminal column and encode it
### I choose **native-country**

In [39]:
#Import the ordinal encoder
from sklearn.preprocessing import OrdinalEncoder
nominal_column = adults2[['native-country']]

# Initialize OrdinalEncoder
oe = OrdinalEncoder()

In [41]:
nominal_column

      native-country
0      United-States
1      United-States
2      United-States
3      United-States
4               Cuba
...              ...
48837  United-States
48838  United-States
48839  United-States
48840  United-States
48841  United-States

[48842 rows x 1 columns]

In [40]:
# Fit and transform the column
encoded_nominal_column = oe.fit_transform(nominal_column)

In [42]:
#Print the result
encoded_nominal_column

array([[39.],
       [39.],
       [39.],
       ...,
       [39.],
       [39.],
       [39.]])

# 2.4 d
### Append it to the dataset

In [44]:
# Replace the original column with the encoded column
adults2['native-country_encoded'] = encoded_nominal_column

In [45]:
#Drop the original one
adults2.drop('native-country', axis=1, inplace=True)

In [47]:
adults2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   age                     48842 non-null  int64
 1   workclass               47879 non-null  object
 2   fnlwgt                  48842 non-null  int64
 3   education               48842 non-null  object
 4   education-num           48842 non-null  int64
 5   marital-status          48842 non-null  object
 6   occupation              47876 non-null  object
 7   relationship            48842 non-null  object
 8   race                    48842 non-null  object
 9   sex                     48842 non-null  object
 10  capital-gain            48842 non-null  int64
 11  capital-loss            48842 non-null  int64
 12  hours-per-week          48842 non-null  int64
 13  income                  48842 non-null  object
 14  native-country_encoded  48568 non-null  float64
dtypes: float64(1), int64(6), object(8)
memory usage: 5.6+ MB

# 2.4 e
### Normalize the numerical data

In [48]:
#Import the important package
from sklearn.preprocessing import MinMaxScaler

In [49]:
 #Select numerical columns
numerical_columns = ['age', 'fnlwgt', 'education-num', 'capital-gain', 'capital-loss', 'hours-per-week']

# Initialize MinMaxScaler
scaler = MinMaxScaler()

In [50]:
# Apply Min-Max Scaling to numerical columns
adults2[numerical_columns] = scaler.fit_transform(adults2[numerical_columns])

In [53]:
adults2.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,income,native-country_encoded
0,0.301370,State-gov,0.044131,Bachelors,0.800000,Never-married,Adm-clerical,Not-in-family,White,Male,0.02174,0.0,0.397959,<=50K,39.0
1,0.452055,Self-emp-not-inc,0.048052,Bachelors,0.800000,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.00000,0.0,0.122449,<=50K,39.0
2,0.287671,Private,0.137581,HS-grad,0.533333,Divorced,Handlers-cleaners,Not-in-family,White,Male,0.00000,0.0,0.397959,<=50K,39.0
3,0.493151,Private,0.150486,11th,0.400000,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.00000,0.0,0.397959,<=50K,39.0
4,0.150685,Private,0.220635,Bachelors,0.800000,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0.00000,0.0,0.397959,<=50K,5.0

############# WRITE YOUR REPORT IN THIS CELL (IF APPLICABLE)####################